WoodyWoodsta/ESP8266-STM32F0-WifiComms/rtos/esp8266wifi-rtos/gcc_Debug.h
// --- Include directories begin --- //
//$(ProjectDir)/Inc
//$(ProjectDir)/Lib/Drivers/CMSIS/Device/ST/STM32F0xx/Include
//$(ProjectDir)/Lib/Drivers/CMSIS/Include
//$(ProjectDir)/Lib/Drivers/STM32F0xx_HAL_Driver/Inc
//$(ProjectDir)/Lib/Middlewares/Third_Party/FreeRTOS/Source/CMSIS_RTOS
//$(ProjectDir)/Lib/Middlewares/Third_Party/FreeRTOS/Source/include
//$(ProjectDir)/Lib/Middlewares/Third_Party/FreeRTOS/Source/portable/GCC/ARM_CM0
//$(LOCALAPPDATA)\VisualGDB\EmbeddedBSPs\arm-eabi\com.sysprogs.arm.stm32/STM32F0xxxx/CMSIS/Device/ST/STM32F0xx/Include
//$(LOCALAPPDATA)\VisualGDB\EmbeddedBSPs\arm-eabi\com.sysprogs.arm.stm32/STM32F0xxxx/CMSIS/Include
//$(LOCALAPPDATA)\VisualGDB\EmbeddedBSPs\arm-eabi\com.sysprogs.arm.stm32/STM32F0xxxx/STM32F0xx_StdPeriph_Driver/inc
//c:\sysgcc\arm-eabi\bin\../lib/gcc/arm-eabi/4.9.2/../../../../arm-eabi/include/c++/4.9.2
//c:\sysgcc\arm-eabi\bin\../lib/gcc/arm-eabi/4.9.2/../../../../arm-eabi/include/c++/4.9.2/arm-eabi/thumb/cortex_m0
//c:\sysgcc\arm-eabi\bin\../lib/gcc/arm-eabi/4.9.2/../../../../arm-eabi/include/c++/4.9.2/backward
//c:\sysgcc\arm-eabi\bin\../lib/gcc/arm-eabi/4.9.2/include
//c:\sysgcc\arm-eabi\bin\../lib/gcc/arm-eabi/4.9.2/include-fixed
//c:\sysgcc\arm-eabi\bin\../lib/gcc/arm-eabi/4.9.2/../../../../arm-eabi/sys-include
//c:\sysgcc\arm-eabi\bin\../lib/gcc/arm-eabi/4.9.2/../../../../arm-eabi/include
// --- Include directories end --- //


// --- Library directories begin --- //
//c:/sysgcc/arm-eabi/bin/../lib/gcc/arm-eabi/4.9.2/thumb/cortex_m0/
//c:/sysgcc/arm-eabi/bin/../lib/gcc/arm-eabi/4.9.2/../../../../arm-eabi/lib/thumb/cortex_m0/
//c:/sysgcc/arm-eabi/bin/../lib/gcc/arm-eabi/4.9.2/
//c:/sysgcc/arm-eabi/bin/../lib/gcc/
//c:/sysgcc/arm-eabi/bin/../lib/gcc/arm-eabi/4.9.2/../../../../arm-eabi/lib/
// --- Library directories begin --- //

